---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.CannotUsePathReinforcementHookTypeStyle
source: html/e6f1e9c3-54e2-14c9-8cb7-2513a2ab2455.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.CannotUsePathReinforcementHookTypeStyle Property

At least one of the bars in the Path Reinforcement has a Bar Type or Shape that is incompatible with the Hook type. Check the Hook permissions for the Bar Type (see Hook Lengths) and the Hook and Rebar Shape styles.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotUsePathReinforcementHookTypeStyle { get; }
```